cases/routeA/template/constant/thermophysicalTransport
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object thermophysicalTransport;
}
laminar
{
    model Fourier;
}
