cases/routeA/template/system/controlDict
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}
solver fluid;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime __ENDTIME__;
deltaT 1;
writeControl timeStep;
writeInterval 100;
purgeWrite 0;
writeFormat ascii;
writePrecision 16;
writeCompression off;
timeFormat general;
timePrecision 12;
runTimeModifiable true;

functions
{
    wallHeatFluxMonitor
    {
        type wallHeatFlux;
        libs ("libfieldFunctionObjects.so");
        patches (hotWall coldWall);
        executeControl timeStep;
        executeInterval 1;
        writeControl timeStep;
        writeInterval 1;
        writeFields false;
    }
    centrelineMonitor
    {
        type sets;
        libs ("libsampling.so");
        interpolationScheme cellPointFace;
        setFormat raw;
        executeControl timeStep;
        executeInterval 10;
        writeControl timeStep;
        writeInterval 10;
        fields (U T);
        sets
        {
            vertical
            {
                type lineUniform;
                axis distance;
                start (0.05 0 0.0005);
                end (0.05 0.1 0.0005);
                nPoints 257;
            }
            horizontal
            {
                type lineUniform;
                axis distance;
                start (0 0.05 0.0005);
                end (0.1 0.05 0.0005);
                nPoints 257;
            }
        }
    }
}
